; domain
(define (domain EMERGENCY_SERVICES_LOGISTICS)
  (:requirements :strips :typing)
  (:types
    phys_object location crate_type - object
    helicopter victim crate - phys_object
    )
  (:constants
    food_crate medicine_crate - crate_type
    depot - location
    )
  (:predicates
    (at ?o - phys_object ?l - location)
    (has_crate ?v - victim ?t - crate_type)
    ;(needs ?v - victim ?t - crate_type)           ; v needs a crate of type t but does not have one
    (carries ?h - helicopter ?c - crate)
    (empty ?h - helicopter)
    (can_be_taken ?c - crate)
    (is_type ?c - crate ?t - crate_type)
    )

  (:action move
   :parameters (?h - helicopter ?from - location ?to - location)
   :precondition
   (and
    (at ?h ?from)
    )
   :effect
   (and
    (at ?h ?to)
    (not (at ?h ?from))
    )
   )

  (:action pick_up
   :parameters (?h - helicopter ?c - crate ?l - location)
   :precondition
   (and
    (at ?h ?l)
    (at ?c ?l)
    (empty ?h)
    (can_be_taken ?c))
   :effect 
   (and 
    (not
    (empty ?h))
    (not (can_be_taken ?c))
    (carries ?h ?c)
    (not (at ?c ?l))
    )
   )

  (:action give
   :parameters (?h - helicopter ?c - crate ?v - victim ?l - location ?t - crate_type)
   :precondition
   (and 
    (carries ?h ?c)
    (is_type ?c ?t)
    (at ?h ?l) (at ?v ?l)
    ;(needs ?v ?t)
    )
   :effect
   (and
    (empty ?h)
    (can_be_taken ?c)
    (not (carries ?h ?c))
    ;(not (needs ?v ?t))
    (has_crate ?v ?t)
    )
   )
  )

; problem
(define (problem helicopter_problem_1_1_10_11_21_2)
(:domain EMERGENCY_SERVICES_LOGISTICS)
(:objects
	helicopter1 - helicopter
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	crate16 - crate
	crate17 - crate
	crate18 - crate
	crate19 - crate
	crate20 - crate
	crate21 - crate
	food_crate - crate_type
	medicine_crate - crate_type
	person1 - victim
	person2 - victim
	person3 - victim
	person4 - victim
	person5 - victim
	person6 - victim
	person7 - victim
	person8 - victim
	person9 - victim
	person10 - victim
	person11 - victim
)
(:init
	(is_type crate1 food_crate)
	(at crate1 depot)
	(can_be_taken crate1)
	(is_type crate2 food_crate)
	(at crate2 depot)
	(can_be_taken crate2)
	(is_type crate3 food_crate)
	(at crate3 depot)
	(can_be_taken crate3)
	(is_type crate4 food_crate)
	(at crate4 depot)
	(can_be_taken crate4)
	(is_type crate5 food_crate)
	(at crate5 depot)
	(can_be_taken crate5)
	(is_type crate6 food_crate)
	(at crate6 depot)
	(can_be_taken crate6)
	(is_type crate7 food_crate)
	(at crate7 depot)
	(can_be_taken crate7)
	(is_type crate8 food_crate)
	(at crate8 depot)
	(can_be_taken crate8)
	(is_type crate9 food_crate)
	(at crate9 depot)
	(can_be_taken crate9)
	(is_type crate10 food_crate)
	(at crate10 depot)
	(can_be_taken crate10)
	(is_type crate11 medicine_crate)
	(at crate11 depot)
	(can_be_taken crate11)
	(is_type crate12 medicine_crate)
	(at crate12 depot)
	(can_be_taken crate12)
	(is_type crate13 medicine_crate)
	(at crate13 depot)
	(can_be_taken crate13)
	(is_type crate14 medicine_crate)
	(at crate14 depot)
	(can_be_taken crate14)
	(is_type crate15 medicine_crate)
	(at crate15 depot)
	(can_be_taken crate15)
	(is_type crate16 medicine_crate)
	(at crate16 depot)
	(can_be_taken crate16)
	(is_type crate17 medicine_crate)
	(at crate17 depot)
	(can_be_taken crate17)
	(is_type crate18 medicine_crate)
	(at crate18 depot)
	(can_be_taken crate18)
	(is_type crate19 medicine_crate)
	(at crate19 depot)
	(can_be_taken crate19)
	(is_type crate20 medicine_crate)
	(at crate20 depot)
	(can_be_taken crate20)
	(is_type crate21 medicine_crate)
	(at crate21 depot)
	(can_be_taken crate21)
	(at helicopter1 depot)
	(empty helicopter1)
	(at person1 loc8)
	(at person2 loc4)
	(at person3 loc8)
	(at person4 loc7)
	(at person5 depot)
	(at person6 loc1)
	(at person7 loc8)
	(at person8 loc2)
	(at person9 loc3)
	(at person10 loc10)
	(at person11 loc2)
)
(:goal (and

	(at helicopter1 depot)
	(has_crate person1 food_crate)
	(has_crate person5 food_crate)
	(has_crate person6 food_crate)
	(has_crate person6 medicine_crate)
	(has_crate person9 medicine_crate)
	(has_crate person10 food_crate)
	))
)

; plan
1. (pick_up helicopter1 crate1 depot)
   deleted: (empty helicopter1) (can_be_taken crate1) (at crate1 depot)
   added: (carries helicopter1 crate1)
   goals met: 1 of 7
2. (give helicopter1 crate1 person5 depot food_crate)
   deleted: (carries helicopter1 crate1)
   added: (empty helicopter1) (can_be_taken crate1) (has_crate person5 food_crate)
   goals met: 2 of 7
3. (pick_up helicopter1 crate2 depot)
   deleted: (empty helicopter1) (can_be_taken crate2) (at crate2 depot)
   added: (carries helicopter1 crate2)
   goals met: 2 of 7
4. (move helicopter1 depot loc10)
   deleted: (at helicopter1 depot)
   added: (at helicopter1 loc10)
   goals met: 1 of 7
5. (give helicopter1 crate2 person10 loc10 food_crate)
   deleted: (carries helicopter1 crate2)
   added: (empty helicopter1) (can_be_taken crate2) (has_crate person10 food_crate)
   goals met: 2 of 7
6. (move helicopter1 loc10 depot)
   deleted: (at helicopter1 loc10)
   added: (at helicopter1 depot)
   goals met: 3 of 7
7. (pick_up helicopter1 crate3 depot)
   deleted: (empty helicopter1) (can_be_taken crate3) (at crate3 depot)
   added: (carries helicopter1 crate3)
   goals met: 3 of 7
8. (move helicopter1 depot loc8)
   deleted: (at helicopter1 depot)
   added: (at helicopter1 loc8)
   goals met: 2 of 7
9. (give helicopter1 crate3 person1 loc8 food_crate)
   deleted: (carries helicopter1 crate3)
   added: (empty helicopter1) (can_be_taken crate3) (has_crate person1 food_crate)
   goals met: 3 of 7
10. (move helicopter1 loc8 depot)
   deleted: (at helicopter1 loc8)
   added: (at helicopter1 depot)
   goals met: 4 of 7
11. (pick_up helicopter1 crate4 depot)
   deleted: (empty helicopter1) (can_be_taken crate4) (at crate4 depot)
   added: (carries helicopter1 crate4)
   goals met: 4 of 7
12. (move helicopter1 depot loc1)
   deleted: (at helicopter1 depot)
   added: (at helicopter1 loc1)
   goals met: 3 of 7
13. (give helicopter1 crate4 person6 loc1 food_crate)
   deleted: (carries helicopter1 crate4)
   added: (empty helicopter1) (can_be_taken crate4) (has_crate person6 food_crate)
   goals met: 4 of 7
14. (move helicopter1 loc1 depot)
   deleted: (at helicopter1 loc1)
   added: (at helicopter1 depot)
   goals met: 5 of 7
15. (pick_up helicopter1 crate11 depot)
   deleted: (empty helicopter1) (can_be_taken crate11) (at crate11 depot)
   added: (carries helicopter1 crate11)
   goals met: 5 of 7
16. (move helicopter1 depot loc3)
   deleted: (at helicopter1 depot)
   added: (at helicopter1 loc3)
   goals met: 4 of 7
17. (give helicopter1 crate11 person9 loc3 medicine_crate)
   deleted: (carries helicopter1 crate11)
   added: (empty helicopter1) (can_be_taken crate11) (has_crate person9 medicine_crate)
   goals met: 5 of 7
18. (move helicopter1 loc3 depot)
   deleted: (at helicopter1 loc3)
   added: (at helicopter1 depot)
   goals met: 6 of 7
19. (pick_up helicopter1 crate12 depot)
   deleted: (empty helicopter1) (can_be_taken crate12) (at crate12 depot)
   added: (carries helicopter1 crate12)
   goals met: 6 of 7
20. (move helicopter1 depot loc1)
   deleted: (at helicopter1 depot)
   added: (at helicopter1 loc1)
   goals met: 5 of 7
21. (give helicopter1 crate12 person6 loc1 medicine_crate)
   deleted: (carries helicopter1 crate12)
   added: (empty helicopter1) (can_be_taken crate12) (has_crate person6 medicine_crate)
   goals met: 6 of 7
22. (move helicopter1 loc1 depot)
   deleted: (at helicopter1 loc1)
   added: (at helicopter1 depot)
   goals met: 7 of 7
